<?php
/**
 * Created by PhpStorm.
 * User: olgakarafizi
 * Date: 24.04.2018
 * Time: 15:43
 */
mb_internal_encoding("UTF-8");

// ЗАДАНИЕ 1 --------------------------------------------------------
echo "<h1> Задание 1 </h1>";

$i = 1;
while ($i <= 100) {
    if ($i % 3 == 0) {
        echo $i . "<br>";
    }
    $i++;
}

// ЗАДАНИЕ 2 --------------------------------------------------------
echo "<h1> Задание 2 </h1>";

$i = 0;
$a = "";

do {
    if ($i == 0) {
        $a = "ноль";
    }
    elseif ($i % 2 == 0) {
        $a = "четное число";
    }
    elseif ($i % 2 == 1) {
        $a = "нечетное число";
    }

    echo $i . " - это " . $a . "<br>";

    $i++;
}
while ($i <= 10);

// ЗАДАНИЕ 3 --------------------------------------------------------
echo "<h1> Задание 3 </h1>";

$region = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Кронштадт"],
    "Рязанская область" => ["Скопин", "Касимов", "Сасово", "Ряжск", "Михайлов", "Шацк"],
    "Челябинчская область" => ["Троицк", "Чебаркуль", "Озерск"]
];

echo '<pre>';
print_r ($region);

// ЗАДАНИЕ 4 --------------------------------------------------------
echo "<h1> Задание 4 </h1>";

$phrase4 = 'Любая фраза для перевода'; //задаю текст

function translation($phrase4) {
    $alphabet = ['А' => 'A', 'а' => 'a', 'Б' => 'B', 'б' => 'b', 'В' => 'V', 'в' => 'v', 'Г' => 'G', 'г' => 'g',
        'Д' => 'D', 'д' => 'd', 'Е' => 'E', 'е' => 'e', 'Ё' => 'Jo', 'ё' => 'jo', 'Ж' => 'Zh', 'ж' => 'zh',
        'З' => 'Z', 'з' => 'z', 'И' => 'I', 'и' => 'i', 'Й' => 'Y', 'й' => 'j', 'К' => 'K', 'к' => 'k',
        'Л' => 'L', 'л' => 'l', 'M' => 'M', 'м' => 'm', 'Н' => 'N', 'н' => 'n', 'О' => 'O', 'о' => 'o',
        'П' => 'P', 'п' => 'p', 'Р' => 'R', 'р' => 'r', 'С' => 'S', 'с' => 's', 'Т' => 'T', 'т' => 't',
        'У' => 'U', 'у' => 'u', 'Ф' => 'F', 'ф' => 'f', 'Х' => 'Kh', 'х' => 'kh', 'Ц' => 'Ts', 'ц' => 'ts',
        'Ч' => 'Ch', 'ч' => 'ch', 'Ш' => 'Sh', 'ш' => 'sh', 'Щ' => 'Shch', 'щ' => 'shch', 'ъ' => '>>', 'ы' => 'y',
        'ь' => '\'', 'Э' => 'E', 'э' => 'e', 'Ю' => 'Yu', 'ю' => 'yu', 'Я' => 'Ya', 'я' => 'ya',]; //алфавит

    $result = strtr($phrase4, $alphabet);

    return $result;
}

echo translation($phrase4);

// ЗАДАНИЕ 5 --------------------------------------------------------
echo "<h1> Задание 5 </h1>";

$phrase5 = 'Любая фраза для замены пробелов подчеркиванием';

$ex5 = strtr($phrase5, " ", "_");

echo $ex5;

// ЗАДАНИЕ 7 --------------------------------------------------------
echo "<h1> Задание 7 </h1>";

for ($i = 0; $i < 10; print $i++ . "<br>") {

}